{"feed":{"entry":[{"link":"/en/revenue-agency/news/2020/12/introducing-a-simplified-process-for-claiming-the-home-office-expenses-for-canadians-working-from-home-due-to-the-covid-19-pandemic.html","teaser":"This year has been filled with unprecedented challenges due to the COVID-19 pandemic. ","publishedDate":"2020-12-15T10:35:00-05:00","title":"Introducing a simplified process for claiming the home office expenses for Canadians working from home due to the COVID-19 pandemic"},{"link":"/en/revenue-agency/news/2020/12/simplifying-the-process-for-claiming-a-deduction-for-home-office-expenses-for-employees-working-from-home-due-to-covid-19.html","teaser":"As a result of the unprecedented challenges due to COVID-19, many people have been working at home and using their kitchens, bedrooms and living rooms as their work space. ","publishedDate":"2020-12-15T10:35:00-05:00","title":"Simplifying the process for claiming a deduction for home office expenses for employees working from home due to COVID-19"},{"link":"/en/revenue-agency/news/2020/12/consultation-on-the-simplification-of-form-t2200-declaration-of-conditions-of-employment-as-a-response-to-the-covid-19-pandemic.html","teaser":"The COVID-19 pandemic has resulted in many Canadian employees working from home to help minimize the spread of the virus, raising questions about how salaried and commissioned employees affected by the new realities can claim work-space-in-the-home and supplies expenses, on their 2020 T1 Individual Income Tax and Benefit Return. ","publishedDate":"2020-12-15T10:35:00-05:00","title":"Consultation on the simplification of Form T2200, Declaration of Conditions of Employment, as a response to the COVID-19 pandemic"},{"link":"/en/revenue-agency/news/2020/12/employer-provided-benefits-and-allowances-cra-and-covid-19.html","teaser":"In light of the COVID-19 pandemic, the Canada Revenue Agency (CRA) recognizes that for many employers and employees, there have been changes in the way that work is being conducted.","publishedDate":"2020-12-15T10:35:00-05:00","title":"Employer-provided benefits and allowances: CRA and COVID-19"},{"link":"/en/revenue-agency/news/2020/11/canada-revenue-agency-opens-applications-for-the-canada-emergency-rent-subsidy.html","teaser":"Canada’s COVID-19 Economic Response Plan has helped to support millions of Canadian workers and businesses throughout the pandemic.","publishedDate":"2020-11-23T11:15:00-05:00","title":"Canada Revenue Agency opens applications for the Canada Emergency Rent Subsidy"},{"link":"/en/revenue-agency/news/2020/11/canada-emergency-rent-subsidy.html","teaser":"The Government is taking targeted action to support Canadians and Canadian businesses, non-profits and charities that continue to face uncertainty and economic challenges because of the COVID-19 pandemic.","publishedDate":"2020-11-23T10:00:00-05:00","title":"Canada Emergency Rent Subsidy"},{"link":"/en/revenue-agency/news/2020/10/the-government-of-canada-launches-applications-for-the-canada-recovery-benefit.html","teaser":"Many people continue to feel the impacts of COVID-19 and require temporary income support. ","publishedDate":"2020-10-12T12:20:00-04:00","title":"The Government of Canada launches applications for the Canada Recovery Benefit "},{"link":"/en/revenue-agency/news/2020/10/the-government-of-canada-launches-applications-for-the-canada-recovery-sickness-benefit-and-the-canada-recovery-caregiving-benefit.html","teaser":"Many people are still being impacted by COVID-19 and require temporary income support.","publishedDate":"2020-10-05T09:10:38-04:00","title":"The Government of Canada launches applications for the Canada Recovery Sickness Benefit and the Canada Recovery Caregiving Benefit"},{"link":"/en/revenue-agency/news/2020/09/the-minister-of-national-revenue-announces-the-appointment-of-the-new-taxpayers-ombud.html","teaser":"Today, the Honourable Diane Lebouthillier, Minister of National Revenue, announced the appointment of the new Taxpayers’ Ombudsperson, Mr. François Boileau, effective October 5, 2020.","publishedDate":"2020-10-01T14:00:00-04:00","title":"The Minister of National Revenue announces the appointment of the new Taxpayers’ Ombudsperson"},{"link":"/en/revenue-agency/news/2020/09/cyber-incidents.html","teaser":"The protection of the personal information of Canadians is a priority for the Canada Revenue Agency (CRA).","publishedDate":"2020-09-16T20:37:15-04:00","title":"Cyber incidents"},{"link":"/en/revenue-agency/news/2020/09/canada-revenue-agency-increases-flat-rate-amount-for-meal-claims-and-reasonable-amount-for-meal-benefits-and-allowances.html","teaser":"Today, the Honourable Marc Garneau, Minister of Transport, on behalf of the Honourable Diane Lebouthillier, Minister of National Revenue, announced that the Canada Revenue Agency (CRA) has increased the amount that employers can use to determine whether an overtime meal or allowance, or the meal portion of a travel allowance is taxable, from $17 to $23.","publishedDate":"2020-09-03T09:00:00-04:00","title":"Canada Revenue Agency increases flat rate amount for meal claims, and reasonable amount for meal benefits and allowances"},{"link":"/en/revenue-agency/news/2020/08/canada-revenue-agency-opens-applications-for-enhanced-canada-emergency-wage-subsidy.html","teaser":"The Canada Emergency Wage Subsidy (CEWS) was created to assist businesses affected by the COVID19 pandemic in keeping workers on their payroll or bringing back previously laid-off employees","publishedDate":"2020-08-17T08:50:35-04:00","title":"Canada Revenue Agency opens applications for enhanced Canada Emergency Wage Subsidy"},{"link":"/en/revenue-agency/news/2020/08/government-of-canada-launches-updated-canada-emergency-wage-subsidy-calculator-to-support-employers.html","teaser":"The Canada Emergency Wage Subsidy (CEWS) helps employers who have been impacted by the COVID-19 pandemic to keep workers on their payroll or bring back previously laid-off employees.","publishedDate":"2020-08-11T11:30:00-04:00","title":"Government of Canada launches updated Canada Emergency Wage Subsidy Calculator to support employers"},{"link":"/en/revenue-agency/news/2020/07/the-canada-revenue-agency-announces-an-extension-to-the-payment-deadline-and-offers-interest-relief-on-outstanding-tax-debts-during-the-covid-19-pa.html","teaser":"The Canada Revenue Agency (CRA) is closely monitoring the COVID-19 situation, and is committed to supporting Canadians throughout it. The CRA understands that individuals and businesses might be dealing with difficulties in meeting their financial obligations, including paying tax debts they may have incurred prior to the crisis. ","publishedDate":"2020-07-27T12:00:00-04:00","title":"The Canada Revenue Agency announces an extension to the payment deadline and offers interest relief on outstanding tax debts during the COVID-19 pandemic"},{"link":"/en/revenue-agency/news/2020/05/benefits-payments-for-eligible-canadians-to-continue-until-fall-2020.html","teaser":"Today, the Honourable Diane Lebouthillier, Minister of National Revenue is announcing that benefit payments will continue for an additional three months for those who are not able to file their 2019 returns on time.","publishedDate":"2020-05-15T09:31:38-04:00","title":"Benefits payments for eligible Canadians to continue until Fall 2020"},{"link":"/en/revenue-agency/news/2020/05/free-tax-clinics-go-virtual.html","teaser":"Free tax clinics are important to communities throughout Canada. Due to concerns surrounding the COVID-19 pandemic, many community organizations had to close, postpone, or scale back on the free tax clinics they offer.","publishedDate":"2020-05-12T13:33:16-04:00","title":"Free tax clinics go virtual"},{"link":"/en/revenue-agency/news/2020/04/government-of-canada-launches-applications-for-the-canada-emergency-wage-subsidy.html","teaser":"To help employers keep and re-hire workers amidst the challenges posed by the COVID-19 pandemic, the Government has implemented the Canada Emergency Wage Subsidy (CEWS). ","publishedDate":"2020-04-27T08:00:00-04:00","title":"Government of Canada launches applications for the Canada Emergency Wage Subsidy"},{"link":"/en/revenue-agency/news/2020/04/canada-emergency-wage-subsidy-application.html","teaser":"To help employers through the challenges posed by the COVID-19 pandemic, the Government has implemented the new Canada Emergency Wage Subsidy (CEWS). The CEWS aims to prevent further job losses, encourage employers to re-hire workers who were laid off as a result of COVID-19, and help position businesses to resume normal operations more easily following the crisis.","publishedDate":"2020-04-26T21:13:45-04:00","title":"Canada Emergency Wage Subsidy - Application"},{"link":"/en/revenue-agency/news/2020/04/government-of-canada-launches-canada-emergency-wage-subsidy-calculator-for-employers.html","teaser":"Today, the Honourable Diane Lebouthillier, Minister of National Revenue, launched the Canada Emergency Wage Subsidy calculator to enable eligible employers to determine the amount they can expect to claim when applying for the wage subsidy. ","publishedDate":"2020-04-21T12:46:00-04:00","title":"Government of Canada launches Canada Emergency Wage Subsidy Calculator for Employers"},{"link":"/en/revenue-agency/news/2020/02/the-cra-has-not-forgottenthe-paper-filer.html","teaser":"Each year almost 90% of Canadian taxpayers choose to file their personal income taxes using electronic methods.","publishedDate":"2020-02-25T07:00:00-05:00","title":"The CRA has not forgotten the paper filer"},{"link":"/en/revenue-agency/news/2020/02/minister-lebouthillier-launches-the-cras-people-first-approach-for-tax-filing-season-2020.html","teaser":"Today, the Honourable Diane Lebouthillier, Minister of National Revenue, launched the 2020 tax filing season.","publishedDate":"2020-02-21T15:29:11-05:00","title":"Minister Lebouthillier launches the CRA’s People First approach for Tax Filing Season 2020"},{"link":"/en/revenue-agency/news/2020/02/2020-tax-filing-season-launch.html","teaser":"Over one hundred years ago, The Income Tax War Act of 1917 was introduced to fund the expenses of the First World War. At the time, the Department of Inland Revenue, which became the Canada Revenue Agency (CRA), had 36 employees across the country. ","publishedDate":"2020-02-21T10:41:00-05:00","title":"2020 tax filing season launch"},{"link":"/en/revenue-agency/news/2020/01/global-tax-chiefs-undertake-unprecedented-multi-country-day-of-action-to-tackle-international-tax-evasion.html","teaser":"A globally coordinated day of action to put a stop to the suspected facilitation of offshore tax evasion has been undertaken this week across the United Kingdom (UK), United States (US), Canada, Australia and the Netherlands. ","publishedDate":"2020-01-23T08:35:00-05:00","title":"Global tax chiefs undertake unprecedented multi-country day of action to tackle international tax evasion"},{"link":"/en/revenue-agency/news/2019/12/government-kicks-off-support-of-canadian-journalism-organizations.html","teaser":"A strong and independent media is essential to a well-functioning democracy. In today’s changing media landscape, Canadian news outlets need support as they evolve to meet the demands of a globalized, digital marketplace.","publishedDate":"2019-12-20T14:58:48-05:00","title":"Government kicks off support of Canadian journalism organizations"},{"link":"/en/revenue-agency/news/2019/12/canada-revenue-agency-releases-serving-canadians-better-consultation-report.html","teaser":"The Canada Revenue Agency (CRA) is listening to Canadians, changing how it works, and improving its services based on Canadians’ feedback.","publishedDate":"2019-12-19T09:00:00-05:00","title":"Canada Revenue Agency releases Serving Canadians Better consultation report  "},{"link":"/en/revenue-agency/news/2019/08/the-government-of-canada-announces-full-membership-of-the-advisory-committee-on-the-charitable-sector.html","teaser":"The Government of Canada recognizes that charities play a key role in our society by providing valuable information and services to Canadians","publishedDate":"2019-08-23T07:51:29-04:00","title":"The Government of Canada announces full membership of the Advisory Committee on the Charitable Sector"},{"link":"/en/revenue-agency/news/2019/08/information-on-the-bulgarian-data-breach--august-7-2019.html","teaser":"Following the recent data breach at the Bulgarian National Revenue Agency (BNRA), the BNRA confirmed with the CRA that a small number of Canadian taxpayers with financial accounts in Bulgaria and Bulgarian taxpayers with financial accounts in Canada have been impacted.","publishedDate":"2019-08-07T16:33:16-04:00","title":"Information on the Bulgarian Data Breach – August 7, 2019"},{"link":"/en/revenue-agency/news/2019/08/minister-lebouthillier-welcomes-the-positive-vote-on-the-new-collective-agreement-between-the-canada-revenue-agency-and-the-professional-institute-.html","teaser":"The Government of Canada is committed to fair and responsible collective bargaining, and respectful collaboration with federal public servants.","publishedDate":"2019-08-02T09:18:33-04:00","title":"Minister Lebouthillier welcomes the positive vote on the new collective agreement between the Canada Revenue Agency and the Professional Institute of the Public Service of Canada"},{"link":"/en/revenue-agency/news/2019/06/the-canada-revenue-agency-thanks-all-canadians-who-provided-feedback-to-the-serving-canadians-better-consultations.html","teaser":"The Canada Revenue Agency (CRA) is listening to Canadians, changing how it works, and improving the services it offers.","publishedDate":"2019-06-19T10:38:00-04:00","title":"The Canada Revenue Agency thanks all Canadians who provided feedback to the Serving Canadians Better consultations "},{"link":"/en/revenue-agency/news/2019/06/minister-of-national-revenue-releases-fifth-report-in-the-tax-gap-series.html","teaser":"The Government of Canada committed in 2016 to calculate the tax gap, fully recognizing that it would help it better target its compliance activities and ensure a tax system that is fair to all Canadians.","publishedDate":"2019-06-18T07:00:00-04:00","title":"Minister of National Revenue releases fifth report in the tax gap series"},{"link":"/en/revenue-agency/news/2019/06/tax-gap-and-compliance-results-for-the-federal-corporate-income-tax-system.html","teaser":"The Canada Revenue Agency (CRA) has published a series of studies on Canada's tax gap.","publishedDate":"2019-06-18T07:00:00-04:00","title":"Tax Gap and Compliance Results for the Federal Corporate Income Tax System"},{"link":"/en/revenue-agency/news/2019/06/minister-of-national-revenue-welcomes-the-offshore-compliance-advisory-committees-recommendations-and-observations-on-the-agencys-response-to-the-p.html","teaser":"The Honourable Diane Lebouthillier, Minister of National Revenue, today issued the following statement: “I thank the Offshore Compliance Advisory Committee (OCAC) members for their work and invaluable input in advising me and the Canada Revenue Agency (CRA) on the important topic of offshore tax compliance.","publishedDate":"2019-06-11T09:31:44-04:00","title":"Minister of National Revenue welcomes the Offshore Compliance Advisory Committee’s recommendations and observations on the Agency’s response to the Panama and Paradise Papers leaks"},{"link":"/en/revenue-agency/news/2019/06/canada-revenue-agency-is-making-improvements-for-small-and-medium-businesses.html","teaser":"The Canada Revenue Agency (CRA) places a special emphasis on working with stakeholders to discuss tax matters, the transformation of its services and the day-to-day management of its activities.","publishedDate":"2019-06-10T08:54:41-04:00","title":"Canada Revenue Agency is making improvements for small and medium businesses"},{"link":"/en/revenue-agency/news/2019/06/one-year-in-j5-making-a-difference.html","teaser":"Leaders from five international tax organizations met in Washington, DC, this week to mark the one-year anniversary of the formation of the J5 and announce the results from its first year. The meeting coincided with a global cyber training event hosted by the United States at the World Bank.","publishedDate":"2019-06-05T11:00:24-04:00","title":"One Year In, J5 Making a Difference"},{"link":"/en/revenue-agency/news/2019/06/joint-chiefs-of-global-tax-enforcement-j5-conduct-media-availability.html","teaser":"J5 Chiefs to conduct media availability to announce first year results from J5 and highlight cyber training hosted by IRS-CI at the World Bank in Washington, DC. ","publishedDate":"2019-06-04T10:17:39-04:00","title":"Joint Chiefs of Global Tax Enforcement (J5) conduct media availability "},{"link":"/en/revenue-agency/news/2019/05/statement-from-the-canada-revenue-agency-regarding-the-decision-in-canada-national-revenue-v-cameco-corporation-2019-fca-67.html","teaser":"The Canada Revenue Agency issued the following statement in response to the April 3, 2019 decision from the Federal Court of Appeal (FCA) that upheld the Federal Court decision (2017 FC 763)","publishedDate":"2019-05-31T12:54:15-04:00","title":"Statement from the Canada Revenue Agency regarding the decision in Canada (National Revenue) v. Cameco Corporation (2019 FCA 67)"},{"link":"/en/revenue-agency/news/2019/05/minister-lebouthillier-marks-the-end-of-the-2019-tax-filing-season.html","teaser":"The Canada Revenue Agency (CRA) is committed to improving its services to help Canadians file their income tax and benefit returns and receive the benefits and credits to which they are entitled in a timely and efficient manner.","publishedDate":"2019-05-31T09:08:57-04:00","title":"Minister Lebouthillier marks the end of the 2019 tax-filing season"},{"link":"/en/revenue-agency/news/2019/05/minister-lebouthillier-to-mark-the-wrap-up-of-the-2019-tax-filing-season-for-individuals.html","teaser":"The Honourable Diane Lebouthillier, Minister of National Revenue, and Deb Schulte, Parliamentary Secretary to the Minister, will mark the wrap-up of the 2019 tax filing season with CRA employees. ","publishedDate":"2019-05-30T13:00:00-04:00","title":"Minister Lebouthillier to mark the wrap-up of the 2019 tax filing season for individuals"},{"link":"/en/revenue-agency/news/2019/05/the-government-of-canada-identifies-more-than-a-billion-dollars-in-additional-taxes-in-british-columbia-and-ontario-real-estate-markets-over-the-la.html","teaser":"Annual real estate audit results released with quarterly update","publishedDate":"2019-05-30T07:35:44-04:00","title":"The Government of Canada identifies more than a billion dollars in additional taxes in British Columbia and Ontario real estate markets over the last four years"},{"link":"/en/revenue-agency/news/2019/05/government-of-canada-delivers-on-disability-advisory-committees-recommendations.html","teaser":"The Government of Canada takes the needs of Canadians with disabilities seriously, and it is improving services to assist them and their families.","publishedDate":"2019-05-24T11:00:19-04:00","title":"Government of Canada delivers on Disability Advisory Committee’s recommendations"},{"link":"/en/revenue-agency/news/2019/05/the-minister-of-national-revenue-announces-expanded-service-to-help-small-businesses.html","teaser":"Small businesses make significant contributions in communities across Canada and are an integral part of the Canadian economy.","publishedDate":"2019-05-10T10:00:00-04:00","title":"The Minister of National Revenue announces expanded service to help small businesses"},{"link":"/en/revenue-agency/news/2019/05/minister-lebouthillier-to-announce-an-expanded-liaison-officer-service-for-small-businesses.html","teaser":"The Honourable Diane Lebouthillier, Minister of National Revenue will make an announcement regarding the improvement in services to small businesses with the presence of the Honourable Marc Garneau, Minister of Transport and Member of Parliament for Notre-Dame-de-Grâce-Westmount, at a local business in his riding. ","publishedDate":"2019-05-08T14:31:46-04:00","title":"Minister Lebouthillier to announce an expanded Liaison Officer Service for small businesses"},{"link":"/en/revenue-agency/news/2019/05/government-of-canadas-statement-in-response-to-auditor-general-of-canada-report-on-the-taxation-of-e-commerce.html","teaser":"Following the tabling of the 2019 Spring Reports of the Auditor General of Canada, the Honourable Diane Lebouthillier, Minister of National Revenue, and the Honourable Ralph Goodale, Minister of Public Safety and Emergency Preparedness, issued the following statement in response to Report 5 entitled “Taxation of E-Commerce,” which included two recommendations for the Canada Revenue Agency (CRA) and one recommendation for the Canada Border Services Agency (CBSA)","publishedDate":"2019-05-07T10:25:05-04:00","title":"Government of Canada’s statement in response to Auditor General of Canada report on the Taxation of E-Commerce"},{"link":"/en/revenue-agency/news/2019/04/government-of-canada-offers-taxpayer-relief-to-canadians-affected-by-flooding.html","teaser":"The Government of Canada recognizes the difficulties faced by Canadians affected by recent flooding across the country and is committed to help reduce their burden.","publishedDate":"2019-04-26T12:59:49-04:00","title":"Government of Canada offers taxpayer relief to Canadians affected by flooding"},{"link":"/en/revenue-agency/news/2019/04/canada-revenue-agency-launches-public-consultations-as-part-of-its-commitment-to-improve-service.html","teaser":"The Canada Revenue Agency (CRA) is listening to Canadians, changing how it works, and improving the services it offers.","publishedDate":"2019-04-23T12:26:51-04:00","title":"Canada Revenue Agency launches public consultations as part of its commitment to improve service"},{"link":"/en/revenue-agency/news/2019/04/external-consultations.html","teaser":"The Canada Revenue Agency (CRA) is listening to Canadians, changing how it works, and improving its services with the goal to be trusted, fair and helpful by putting people first. ","publishedDate":"2019-04-23T11:33:37-04:00","title":"External Consultations "},{"link":"/en/revenue-agency/news/2019/04/minister-lebouthillier-to-discuss-clean-economy-and-budget-2019-in-chandler.html","teaser":"The Honourable Diane Lebouthillier, Minister of National Revenue and Member of Parliament for Gaspésie–Les Îles-de-la-Madeleine, will make an announcement to highlight the Government of Canada’s investments in zero-emission vehicles, the environment and innovation on behalf of the Minister of Transport, the Honourable Marc Garneau.","publishedDate":"2019-04-17T11:38:53-04:00","title":"Minister Lebouthillier to discuss clean economy and Budget 2019 in Chandler"},{"link":"/en/revenue-agency/news/2019/04/an-innovative-federal-program-that-makes-it-more-affordable-for-young-canadians-to-buy-their-first-home.html","teaser":"Our Government strongly believes that all Canadians should have access to safe and affordable housing. That is why we are introducing an innovative tool under Canada’s first ever National Housing Strategy.","publishedDate":"2019-04-15T14:21:33-04:00","title":"An innovative federal program that makes it more affordable for young Canadians to buy their first home"},{"link":"/en/revenue-agency/news/2019/04/the-honourable-diane-lebouthillier-minister-of-national-revenue-to-discuss-new-measures-to-make-home-ownership-more-affordable-for-first-time-home-.html","teaser":"The Honourable Diane Lebouthillier, Minister of National Revenue, will participate in an announcement with the presence of the mayor of Mirabel, Mr. Jean Bouchard, where she will highlight new measures to make home ownership more affordable for first-time home buyers and Budget 2019.","publishedDate":"2019-04-12T15:46:36-04:00","title":"The Honourable Diane Lebouthillier, Minister of National Revenue, to discuss new measures to make home ownership more affordable for first-time home buyers and Budget 2019 in Mirabel"},{"link":"/en/revenue-agency/news/2019/03/making-it-easier-for-northern-residents-to-claim-lowest-return-airfare.html","teaser":"The Canada Revenue Agency (CRA) is responding to the challenges northern residents face in meeting their tax obligations.","publishedDate":"2019-03-18T11:59:25-04:00","title":"Making it easier for northern residents to claim lowest return airfare"},{"link":"/en/revenue-agency/news/2019/03/the-government-of-canada-delivers-on-its-commitment-to-modernize-the-rules-governing-the-charitable-sector.html","teaser":"Charities play a key role in our society and provide valuable services to Canadians, including the most vulnerable, and the Government of Canada recognizes the vast experience they bring to our public debate.","publishedDate":"2019-03-07T15:52:48-05:00","title":"The Government of Canada delivers on its commitment to modernize the rules governing the charitable sector"},{"link":"/en/revenue-agency/news/2019/02/backgrounder--2019-tax-filing-season.html","teaser":"Starting on February 18, 2019, Canadians can file their income tax and benefit returns online, on paper, or by telephone (for those who qualify).","publishedDate":"2019-02-19T10:00:00-05:00","title":"Backgrounder – 2019 Tax filing season"},{"link":"/en/revenue-agency/news/2019/02/the-canada-revenue-agency-launches-the-2019-tax-filing-season.html","teaser":"Today, the Honourable Diane Lebouthillier, Minister of National Revenue, announced that the 2019 tax filing season is officially open. The Canada Revenue Agency (CRA) has now begun processing income tax and benefit returns filed by Canadians in the way that is most convenient for them. Canadians can file their income tax and benefit returns online, on paper, or by telephone for those who qualify.","publishedDate":"2019-02-19T10:00:00-05:00","title":"The Canada Revenue Agency launches the 2019 tax filing season"},{"link":"/en/revenue-agency/news/2019/02/canada-revenue-agency-officials-to-provide-media-briefing-on-the-2019-t1-filing-season.html","teaser":"On Tuesday, February 19th, 2019, CRA Deputy Assistant Commissioner Gillian Pranke, along with officials from the Canada Revenue Agency will hold a for-attribution media briefing on the 2019 T1 filing season. ","publishedDate":"2019-02-18T10:00:00-05:00","title":"Canada Revenue Agency officials to provide media briefing on the 2019 T1 filing season"},{"link":"/en/revenue-agency/news/2019/02/cras-northern-service-centres.html","teaser":"CRA employees based in the Northern Service Centres will provide a year-round presence to support individuals and businesses in the Yukon, Northwest Territories and Nunavut.","publishedDate":"2019-02-12T14:41:35-05:00","title":"CRA’s Northern Service Centres"},{"link":"/en/revenue-agency/news/2019/02/minister-lebouthillier-opens-three-canada-revenue-agency-northern-service-centres.html","teaser":"The Canada Revenue Agency (CRA) takes pride in serving millions of Canadians each and every year, from coast to coast to coast. ","publishedDate":"2019-02-11T07:37:26-05:00","title":"Minister Lebouthillier opens three Canada Revenue Agency Northern Service Centres"},{"link":"/en/revenue-agency/news/2019/02/minister-lebouthillier-opens-canada-revenue-agency-northern-service-centre-in-yellowknife.html","teaser":"On Monday, February 11, 2019, the Honourable Diane Lebouthillier, Minister of National Revenue, and Michael McLeod, Member of Parliament for Northwest Territories, will participate in an event to mark the official opening of the Canada Revenue Agency Northern Service Centre in Yellowknife, Northwest Territories.","publishedDate":"2019-02-07T15:43:56-05:00","title":"Minister Lebouthillier opens Canada Revenue Agency Northern Service Centre in Yellowknife"},{"link":"/en/revenue-agency/news/2019/02/mp-larry-bagnell-opens-canada-revenue-agency-northern-service-centre-in-whitehorse.html","teaser":"On Monday, February 11, 2019, Larry Bagnell, Member of Parliament for Yukon, on behalf of the Honourable Diane Lebouthillier, Minister of National Revenue, will participate in an event to mark the official opening of the Canada Revenue Agency Northern Service Centre in Whitehorse, Yukon.","publishedDate":"2019-02-07T15:38:58-05:00","title":"MP Larry Bagnell opens Canada Revenue Agency Northern Service Centre in Whitehorse"},{"link":"/en/revenue-agency/news/2019/02/parliamentary-secretary-deb-schulte-opens-canada-revenue-agency-northern-service-centre-in-iqaluit.html","teaser":"On Monday, February 11, 2019, Deb Schulte, Parliamentary Secretary to the Minister of National Revenue, will participate in an event to mark the official opening of the Canada Revenue Agency Northern Service Centre in Iqaluit, Nunavut.","publishedDate":"2019-02-07T15:15:18-05:00","title":"Parliamentary Secretary Deb Schulte opens Canada Revenue Agency Northern Service Centre in Iqaluit"},{"link":"/en/revenue-agency/news/2019/02/government-of-canada-announces-construction-of-new-federal-building-in-shawinigan.html","teaser":"On behalf of the Government of Canada, the Honourable Diane Lebouthillier, Minister of National Revenue, the Honourable François-Philippe Champagne, Minister of Infrastructure and Communities and Member of Parliament for Saint-Maurice–Champlain, and Steven MacKinnon, Parliamentary Secretary to the Minister of Public Services and Procurement and Accessibility, announced today the construction of a new building on the current site of the Canada Revenue Agency (CRA) National Verification and Collections Centre (NVCC) in Shawinigan. ","publishedDate":"2019-02-04T07:39:06-05:00","title":"Government of Canada announces construction of new federal building in Shawinigan"},{"link":"/en/revenue-agency/news/2019/02/ministers-lebouthillier-and-champagne-to-announce-real-estate-investment-in-the-city-of-shawinigan.html","teaser":"Shawinigan, Quebec, February 1, 2019 – The Honourable Diane Lebouthillier, Minister of National Revenue, and the Honourable François Philippe Champagne, Minister of Infrastructure and Communities, also Member of Parliament for Saint-Maurice–Champlain, accompanied by Steven MacKinnon, Parliamentary Secretary to the Minister of Public Services and Procurement and Accessibility, will be making an announcement regarding a Government of Canada real estate investment in the City of Shawinigan in the Mauricie region. ","publishedDate":"2019-02-01T12:46:54-05:00","title":"Ministers Lebouthillier and Champagne to announce real estate investment in the City of Shawinigan"},{"link":"/en/revenue-agency/news/2018/09/digital-service-collaboration-plan-between-the-cra-and-tax-filer-empowerment-canada.html","teaser":"The CRA and Tax-filer Empowerment Canada (TFEC), an association of Canada’s leading tax preparation and software firms, have signed a joint digital service improvement plan to improve services for Canadians.","publishedDate":"2018-09-27T14:21:01-04:00","title":"Digital service collaboration plan between the CRA and Tax-filer Empowerment Canada"},{"link":"/en/revenue-agency/news/2018/08/minister-lebouthillier-announces-the-opening-of-three-canada-revenue-agency-northern-service-centres.html","teaser":"The Government of Canada is committed to ensuring that all Canadians, regardless of where they live, have access to Canada Revenue Agency (CRA) services.","publishedDate":"2018-08-24T08:51:59-04:00","title":"Minister Lebouthillier announces the opening of three Canada Revenue Agency Northern Service Centres"},{"link":"/en/revenue-agency/news/2018/07/statement-by-the-minister-of-national-revenue-on-canadas-successful-first-exchange-of-the-country-by-country-reporting-initiative.html","teaser":"The Honourable Diane Lebouthillier, Minister of National Revenue, today issued the following statement on Canada’s successful first round of exchanges of Country-by-Country reports.","publishedDate":"2018-07-09T16:02:28-04:00","title":"Statement by the Minister of National Revenue on Canada’s successful first exchange of the Country-by-Country reporting initiative"},{"link":"/en/revenue-agency/news/2018/03/havent-done-your-taxes-yet-heres-what-you-need-to-know.html","teaser":"This year, as a result of a number of new services that the Canada Revenue Agency (CRA) has put in place, it has never been simpler and quicker to prepare an income tax return. Canadians have only a few more weeks to file their return.","publishedDate":"2018-03-27T16:33:50-04:00","title":"Haven’t done your taxes yet? Here's what you need to know"},{"link":"/en/revenue-agency/news/2017/08/minister_lebouthillierannouncesnewchairandboardmemberofthecanada.html","teaser":"The Honourable Diane Lebouthillier, Minister of National Revenue, today announced the appointment of Suzanne Gouin, MBA, ICD.D, to the Canada Revenue Agency (CRA) Board of Management as Chair.","publishedDate":"2017-08-25T12:42:33-04:00","title":"Minister Lebouthillier announces new Chair and Board Member of the Canada Revenue Agency's Board of Management"},{"link":"/en/revenue-agency/news/2017/06/minister_lebouthillierannouncesimprovementsatthecratobetterserve.html","teaser":"The Government of Canada is committed to ensuring tax fairness for all Canadians, and recognizes the importance of small and medium businesses in creating jobs and growing the economy. This is why it made a commitment to overhaul its service model so that people who interact with the Canada Revenue Agency (CRA) feel like valued clients, not just taxpayers.","publishedDate":"2017-06-27T14:00:00-04:00","title":"Minister Lebouthillier announces improvements at the CRA to better serve small and medium businesses"},{"link":"/en/revenue-agency/news/2017/06/the_government_ofcanadacracksdownontaxcheatinginrealestatetransa.html","teaser":"The Government of Canada recognizes the importance of ensuring a healthy, competitive, and stable housing market for all Canadians, while also working to improve tax fairness. To that end, the Government of Canada has taken significant steps to address tax cheating in real estate transactions.","publishedDate":"2017-06-16T12:00:05-04:00","title":"The Government of Canada cracks down on tax cheating in real estate transactions"},{"link":"/en/revenue-agency/news/2017/06/minister_lebouthillierannouncesconsultationsonchangestothevolunt.html","teaser":"Canadians work hard, pay their share of taxes and expect a tax system that is responsive and fair. Unfortunately, some wealthy Canadians continue to find ways to not pay what they owe, which places an unfair burden on Canadians. This situation has to change. That is why the Government of Canada is cracking down on tax cheats.","publishedDate":"2017-06-09T16:39:48-04:00","title":"Minister Lebouthillier announces consultations on changes to the Voluntary Disclosures Program to ensure a fairer tax system for all Canadians"},{"link":"/en/revenue-agency/news/2017/06/minister_lebouthillierreleasesastudyonindividualincometaxgapinca.html","teaser":"Canadians work hard for their money, pay their fair share of taxes and expect a tax system that is responsive and impartial.","publishedDate":"2017-06-06T15:26:57-04:00","title":"Minister Lebouthillier releases a study on individual income tax gap in Canada"},{"link":"/en/revenue-agency/news/2017/06/minister_lebouthillierupdatescanadiansonthegovernmentsprogressto.html","teaser":"Hard-working Canadians pay taxes and in return, expect a tax system that is fair and where everyone pays their share.","publishedDate":"2017-06-01T09:17:14-04:00","title":"Minister Lebouthillier Updates Canadians on the Government’s Progress to Crack Down on Tax Cheats"},{"link":"/en/revenue-agency/news/2017/05/a_record_number_ofcanadiansareusingthecanadarevenueagencysonline.html","teaser":"The Government of Canada is committed to improving services to Canadians and making sure the Canada Revenue Agency (CRA) is more helpful and easier to use.","publishedDate":"2017-05-11T14:01:33-04:00","title":"A record number of Canadians are using the Canada Revenue Agency’s online services"},{"link":"/en/revenue-agency/news/2017/05/government_of_canadaofferstaxpayerrelieftocanadiansaffectedbyflo.html","teaser":"The Government of Canada recognizes the difficulties faced by Canadians affected by recent flooding across the country, particularly in Quebec and Ontario, and is committed to help reduce their burden.","publishedDate":"2017-05-08T20:57:35-04:00","title":"Government of Canada offers taxpayer relief to Canadians affected by flooding"},{"link":"/en/revenue-agency/news/2017/05/minister_lebouthillierwelcomesthepanelreportonthepublicconsultat.html","teaser":"Charities play a key role in Canadian society and provide valuable services to Canadians. The Government of Canada recognizes the vast experience they bring to public debate and to the formulation of public policy. ","publishedDate":"2017-05-04T11:44:29-04:00","title":"Minister Lebouthillier welcomes the Panel Report on the public consultations on charities and political activities"},{"link":"/en/revenue-agency/news/2017/03/minister_lebouthillierhighlightsnewin-personsupportoptionsforsma.html","teaser":"The Government of Canada recognizes the important role of small businesses in creating jobs and supporting the economy. ","publishedDate":"2017-03-31T09:43:45-04:00","title":"Minister Lebouthillier highlights new in-person support options for small businesses in the Greater Toronto Area"},{"link":"/en/revenue-agency/news/2017/03/minister_lebouthillierconcludesvisittowesternprovinceswithstopat.html","teaser":"The Government of Canada is committed to improving its service model and making it more client-focused to ensure tax fairness for the middle class. Canadians who interact with Canada Revenue Agency (CRA) must be treated as important clients and not simply as taxpayers.","publishedDate":"2017-03-18T17:00:00-04:00","title":"Minister Lebouthillier concludes visit to Western provinces with stop in the Yukon"},{"link":"/en/revenue-agency/news/2017/03/minister_lebouthillieremphasizesservicetocanadianswhiletouringbr.html","teaser":"The Government of Canada is committed to improving its service model and making it more client-focused to ensure tax fairness for the middle class. Canadians who interact with Canada Revenue Agency (CRA) must be treated as important clients and not simply as taxpayers.","publishedDate":"2017-03-17T19:00:00-04:00","title":"Minister Lebouthillier emphasizes service to Canadians while touring British Columbia"},{"link":"/en/revenue-agency/news/2017/03/minister_lebouthilliertouringsaskatchewantohighlightgovernmentof.html","teaser":"The Government of Canada recognizes the important role of small and medium size businesses in creating jobs and supporting the economy.","publishedDate":"2017-03-14T14:54:43-04:00","title":"Minister Lebouthillier touring Saskatchewan to highlight Government of Canada’s commitment to access services at the Canada Revenue Agency"},{"link":"/en/revenue-agency/news/2017/03/the_government_ofcanadalaunchesnewjointinitiativetohelpcanadians.html","teaser":"The Government of Canada is committed to offering electronic services to Canadians so that they can quickly and easily access their information and complete their online transactions. ","publishedDate":"2017-03-07T14:18:30-05:00","title":"The Government of Canada launches new joint initiative to help Canadians access their benefit information online"},{"link":"/en/revenue-agency/news/2017/03/statement_from_thehonourabledianelebouthillierministerofnational.html","teaser":"The Honourable Diane Lebouthillier, Minister of National Revenue, delivered the following statement to update Canadians on the important efforts and progress made by the Government of Canada to crack down on tax cheats and ensure a tax system that is fair and responsive for all Canadians.","publishedDate":"2017-03-05T12:45:01-05:00","title":"Statement from the Honourable Diane Lebouthillier, Minister of National Revenue"},{"link":"/en/revenue-agency/news/2017/02/government_of_canadatablesitsresponsetothestandingcommitteeonfin.html","teaser":"Canadians work hard for their money and the majority pay their taxes, but some wealthy individuals participate in complex tax schemes to evade paying their fair share.","publishedDate":"2017-02-23T13:53:11-05:00","title":"Government of Canada Tables its Response to the Standing Committee on Finance on Efforts to Crack Down on Tax Cheats"},{"link":"/en/revenue-agency/news/2020/12/tax-gap-for-federal-excise-duty-on-cigarettes-and-payment-tax-gap-reports.html","teaser":"The Canada Revenue Agency (CRA) has published a series of studies on Canada's tax gap.","publishedDate":"2020-12-17T10:15:00-05:00","title":"Tax gap for Federal Excise Duty on Cigarettes and Payment Tax Gap Reports"},{"link":"/en/revenue-agency/news/2020/12/minister-of-national-revenue-publishes-two-new-reports-in-the-tax-gap-series.html","teaser":"Today, the Honourable Diane Lebouthillier, Minister of National Revenue, announced the release of two new tax gap reports on federal excise duty on cigarettes and the payment gap.","publishedDate":"2020-12-17T10:15:00-05:00","title":"Minister of National Revenue publishes two new reports in the tax gap series"},{"link":"/en/revenue-agency/news/2020/12/canada-revenue-agency-launches-the-canada-emergency-wage-subsidy-registry.html","teaser":"To protect Canadians’ jobs and support businesses throughout the pandemic, the Government of Canada introduced the Canada Emergency Wage Subsidy (CEWS).","publishedDate":"2020-12-21T15:00:00-05:00","title":"Canada Revenue Agency launches the Canada Emergency Wage Subsidy Registry"},{"link":"/en/revenue-agency/news/2021/01/new-support-for-organizations-hosting-free-tax-clinics.html","teaser":"The Canada Revenue Agency recognizes the value of free tax clinics that help Canadians do their taxes so they can get the benefit and credits they are entitled to. We also know the costs of running these clinics can be a challenge for organizations who want to participate.","publishedDate":"2021-01-06T11:00:44-05:00","title":"New support for organizations hosting free tax clinics"},{"link":"/en/revenue-agency/news/2021/01/canada-revenue-agency-to-begin-issuing-t4as-to-covid-19-emergency-and-recovery-benefit-recipients.html","teaser":"Since the beginning of the COVID-19 pandemic, the Government of Canada rolled out measures to support Canadians through this public health crisis.","publishedDate":"2021-01-11T18:34:00-05:00","title":"Canada Revenue Agency to begin issuing T4As to COVID-19 emergency and recovery benefit recipients"},{"link":"/en/revenue-agency/news/2021/01/the-canada-revenue-agency-is-acting-to-improve-service-to-canadians-this-tax-filing-season.html","teaser":"To get ready for a tax filing season like no other, we’ve introduced a number of measures to help taxpayers get the tax and benefit information they need.","publishedDate":"2021-01-31T09:30:00-05:00","title":"The Canada Revenue Agency is acting to improve service to Canadians this tax filing season"},{"link":"/en/revenue-agency/news/2021/02/government-of-canada-announces-targeted-interest-relief-on-2020-income-tax-debt-for-low--and-middle-income-canadians.html","teaser":"Since the beginning of the COVID-19 pandemic, the Government of Canada has provided urgently-needed income support to millions of Canadians, which has helped them put food on the table and keep a roof over their heads during this crisis. The federal government is committed to continuing to support Canadians throughout this crisis.","publishedDate":"2021-02-09T07:15:00-05:00","title":"Government of Canada addresses CERB repayments for self-employed individuals and announces interest relief on 2020 income tax debt due to COVID-19 related income support"},{"link":"/en/revenue-agency/news/2021/02/the-canada-revenue-agency-is-here-to-help-canadians-through-a-tax-season-like-no-other.html","teaser":"Over the past year, Canadians have faced challenges due to the COVID-19 pandemic and many have had to adapt to changes at work and at home.","publishedDate":"2021-02-22T10:00:00-05:00","title":"The Canada Revenue Agency is here to help Canadians through a tax season like no other"},{"link":"/en/revenue-agency/news/2021/02/statement-by-the-minister-of-national-revenue-the-honourable-diane-lebouthillier-on-the-auditor-general-of-canadas-performance-audit-of-the-canada-.html","teaser":"Following the tabling of the 2021 Winter Reports of the Auditor General of Canada (OAG), the Minister of National Revenue, the Honourable Diane Lebouthillier, issued the following statement in response to the report entitled, \"Canada Child Benefit - Canada Revenue Agency,\" which included two recommendations for the Canada Revenue Agency (CRA): “The Canada child benefit (CCB) has a major impact on the lives of middle-class Canadians, helping over 3.3 million families with the cost of raising children under 18 years of age.","publishedDate":"2021-02-25T15:30:00-05:00","title":"Statement by the Minister of National Revenue, the Honourable Diane Lebouthillier, on the Auditor General of Canada (OAG)’s performance audit of the Canada child benefit (CCB)"},{"link":"/en/revenue-agency/news/2021/03/accounts-locked-on-february-16.html","teaser":"The Canada Revenue Agency (CRA) is committed to protecting the personal and tax information of Canadians.","publishedDate":"2021-03-12T20:55:00-05:00","title":"Accounts locked on February 16"},{"link":"/en/revenue-agency/news/2021/03/statement-by-the-minister-of-national-revenue-the-honourable-diane-lebouthillier-on-the-auditor-general-of-canada-oags-performance-audit-of-the-can.html","teaser":"Following the tabling of the 2021 performance audit of the Canada Emergency Wage Subsidy (CEWS) by the Office of the Auditor General (OAG) of Canada, the Minister of National Revenue, the Honourable Diane Lebouthillier issued the following statement in response to the report entitled, \"Canada Emergency Wage Subsidy,\" which included three recommendations for the Canada Revenue Agency (CRA):","publishedDate":"2021-03-25T10:01:45-04:00","title":"Statement by the Minister of National Revenue the Honourable Diane Lebouthillier, on the Auditor General of Canada (OAG)’s performance audit of the Canada Emergency Wage Subsidy (CEWS)"},{"link":"/en/revenue-agency/news/2021/03/the-minister-of-national-revenue-announces-the-reappointment-of-the-chair-of-the-canada-revenue-agencys-board-of-management.html","teaser":"The Honourable Diane Lebouthillier, Minister of National Revenue, today announced that Ms. Suzanne Gouin, MBA, ICD.D, has been reappointed Chair of the Canada Revenue Agency’s (CRA) Board of Management for a five-year term.","publishedDate":"2021-03-31T15:50:22-04:00","title":"The Minister of National Revenue announces the reappointment of the Chair of the Canada Revenue Agency's Board of Management"},{"link":"/en/revenue-agency/news/2021/04/the-government-of-canada-welcomes-the-recent-publication-of-the-disability-advisory-committees-second-annual-report-and-restates-its-support-for-ca.html","teaser":"Today, the Honourable Diane Lebouthillier, Minister of National Revenue, released the Government's response to the second annual report of the Disability Advisory Committee (Committee).","publishedDate":"2021-04-09T11:00:00-04:00","title":"The Government of Canada welcomes the recent publication of the Disability Advisory Committee’s second annual report and restates its support for Canadians with disabilities, their families and caregivers"},{"link":"/en/revenue-agency/news/2021/04/statement-by-the-minister-of-national-revenue-the-honourable-diane-lebouthillier-for-national-volunteer-week.html","teaser":"The Minister of National Revenue, the Honourable Diane Lebouthillier, issued the following statement during National Volunteer Week 2021","publishedDate":"2021-04-18T12:00:00-04:00","title":"Statement by the Minister of National Revenue, the Honourable Diane Lebouthillier, for National Volunteer Week"},{"link":"/en/revenue-agency/news/2021/04/readout-minister-diane-lebouthillier-met-with-femmessor--april-27-2021.html","teaser":"Today, the Minister of National Revenue Diane Lebouthillier met with female entrepreneurs and leaders at an event hosted by Femmessor in Gaspésie to discuss how the Government of Canada is investing in a sustainable, inclusive, feminist and resilient economy.","publishedDate":"2021-04-27T15:17:47-04:00","title":"Readout: Minister Diane Lebouthillier met with Femmessor – April 27, 2021"},{"link":"/en/revenue-agency/news/2021/05/three-good-reasons-to-file-your-tax-return--even-though-the-deadline-has-already-passed.html","teaser":"While the April 30, 2021 deadline for individuals to file their 2020 tax return has come and gone, the Canada Revenue Agency (CRA) would like to remind Canadians that it’s still possible to file a return, and that there are several good reasons to do so.","publishedDate":"2021-05-05T10:30:00-04:00","title":"Three good reasons to file your tax return – even though the deadline has already passed"},{"link":"/en/revenue-agency/news/2021/05/ccb-young-child-supplement-2021.html","teaser":"In the November 2020 Fall Economic Statement, the Government of Canada proposed an additional supplement be offered to families entitled to the Canada child benefit (CCB) with children under the age of six for the year 2021 to provide relief during Canada’s recovery from COVID-19.","publishedDate":"2021-05-12T10:40:00-04:00","title":"CCB young child supplement, 2021"},{"link":"/en/revenue-agency/news/2021/05/up-to-1200-more-per-child-for-16-million-families-across-canada.html","teaser":"In the first four years since its implementation, the Canada Child Benefit (CCB) has helped lift nearly 435,000 children out of poverty. ","publishedDate":"2021-05-12T10:40:00-04:00","title":"Up to $1,200 more per child for 1.6 million families across Canada"},{"link":"/en/revenue-agency/news/2021/05/government-of-canada-to-reimburse-self-employed-workers-who-repaid-the-cerb.html","teaser":"Over the course of the COVID-19 pandemic, the Government of Canada has introduced historic measures to support Canadians, including the Canada Emergency Response Benefit (CERB). ","publishedDate":"2021-05-27T14:00:37-04:00","title":"Government of Canada to reimburse self-employed workers who repaid the CERB"},{"link":"/en/revenue-agency/news/2021/06/the-government-of-canada-launches-online-calculator-to-help-businesses-apply-for-the-new-canada-recovery-hiring-program.html","teaser":"The Government of Canada remains committed to supporting Canadian businesses in the face of the ongoing pandemic.","publishedDate":"2021-06-30T08:00:00-04:00","title":"The Government of Canada launches online calculator to help businesses apply for the new Canada Recovery Hiring Program"},{"link":"/en/revenue-agency/news/2021/06/some-foreign-based-digital-economy-businesses-will-begin-charging-gsthst-on-july-1-2021.html","teaser":"Many mobile apps, online video streaming services and other digital platform-based products that Canadians enjoy are sold by businesses beyond our borders.","publishedDate":"2021-06-30T15:00:50-04:00","title":"Some foreign-based digital economy businesses will begin charging GST/HST on July 1, 2021"},{"link":"/en/revenue-agency/news/2018/04/service-improvements-are-benefiting-millions-of-canadians-this-tax-season.html","teaser":"The Canada Revenue Agency (CRA) is committed to improving its services to help Canadians file their income tax and benefit return and receive the benefits and credits they are entitled to in a timely and efficient manner. ","publishedDate":"2018-04-27T14:39:21-04:00","title":"Service improvements are benefiting millions of Canadians this tax season"},{"link":"/en/revenue-agency/news/2021/12/covid-19-recovery-programs-continue-to-provide-support-to-canadian-businesses-and-organizations.html","teaser":"The Government of Canada remains committed to supporting Canadian businesses and organizations in the face of the ongoing pandemic.","publishedDate":"2021-12-21T15:50:00-05:00","title":"COVID-19 Recovery Programs continue to provide support to Canadian businesses and organizations"},{"link":"/en/revenue-agency/news/2021/12/the-government-of-canada-launches-applications-for-the-expanded-canada-worker-lockdown-benefit.html","teaser":"The Government of Canada is committed to supporting Canadian workers, businesses and service providers through the COVID-19 pandemic. ","publishedDate":"2021-12-30T13:52:57-05:00","title":"The Government of Canada launches applications for the expanded Canada Worker Lockdown Benefit "},{"link":"/en/revenue-agency/news/2021/12/canada-worker-lockdown-benefit.html","teaser":"From the beginning of the COVID-19 pandemic, the Government of Canada has put Canadians first, providing them with the support they need to stay safe and healthy.","publishedDate":"2021-12-30T16:13:25-05:00","title":"Canada Worker Lockdown Benefit"},{"link":"/en/revenue-agency/news/2022/01/the-canada-revenue-agency-is-recruiting-candidates-in-several-regions.html","teaser":"The Canada Revenue Agency (CRA) seeks to fill several customer service positions of various levels. It is no longer necessary to live in a city where there is a CRA office; working remotely makes it possible to obtain interesting positions everywhere in Quebec.","publishedDate":"2022-01-06T10:13:10-05:00","title":"The CRA is recruiting candidates across all Québec regions"},{"link":"/en/revenue-agency/news/2022/02/another-unique-tax-filing-season-opens-today.html","teaser":"The Canada Revenue Agency (CRA) has officially opened tax-filing season, meaning that Canadians can now file their 2021 income tax and benefit returns online. ","publishedDate":"2022-02-21T07:00:00-05:00","title":"Another unique tax-filing season opens today"},{"link":"/en/revenue-agency/news/2022/02/prince-edward-island-tax-filing-season-starts-today.html","teaser":"The Canada Revenue Agency (CRA) is committed to making sure residents of Prince Edward Island get the benefits and credits they are entitled to. ","publishedDate":"2022-02-21T08:00:00-05:00","title":"Prince Edward Island, tax-filing season starts today!"},{"link":"/en/revenue-agency/news/2022/02/newfoundland-and-labrador-tax-filing-season-starts-today.html","teaser":"The Canada Revenue Agency (CRA) is committed to making sure residents of Newfoundland and Labrador get the benefits and credits they are entitled to. ","publishedDate":"2022-02-21T08:00:00-05:00","title":"Newfoundland and Labrador, tax-filing season starts today!"},{"link":"/en/revenue-agency/news/2022/02/new-brunswick-tax-filing-season-starts-today.html","teaser":"The Canada Revenue Agency (CRA) is committed to making sure residents of New Brunswick get the benefits and credits they are entitled to.","publishedDate":"2022-02-21T09:00:00-05:00","title":"New Brunswick, tax-filing season starts today!"},{"link":"/en/revenue-agency/news/2022/02/nova-scotia-tax-filing-season-starts-today.html","teaser":"The Canada Revenue Agency (CRA) is committed to making sure residents of Nova Scotia get the benefits and credits they are entitled to. ","publishedDate":"2022-02-21T09:00:00-05:00","title":"Nova Scotia, tax-filing season starts today!"},{"link":"/en/revenue-agency/news/2022/02/tax-filing-season-starts-today-in-canada.html","teaser":"The Canada Revenue Agency (CRA) is committed to making sure residents of Quebec get the benefits and credits they are entitled to.","publishedDate":"2022-02-21T10:00:00-05:00","title":"Tax-filing season starts today in Canada!"},{"link":"/en/revenue-agency/news/2022/02/ontario-tax-filing-season-starts-today.html","teaser":"The Canada Revenue Agency (CRA) is committed to making sure residents of Ontario get the benefits and credits they are entitled to. ","publishedDate":"2022-02-21T11:00:00-05:00","title":"Ontario, tax-filing season starts today!"},{"link":"/en/revenue-agency/news/2022/02/manitoba-tax-filing-season-starts-today.html","teaser":"The Canada Revenue Agency (CRA) is committed to making sure residents of Manitoba get the benefits and credits they are entitled to. ","publishedDate":"2022-02-21T12:00:00-05:00","title":"Manitoba, tax-filing season starts today!"},{"link":"/en/revenue-agency/news/2022/02/saskatchewan-tax-filing-season-starts-today.html","teaser":"The Canada Revenue Agency (CRA) is committed to making sure residents of Saskatchewan get the benefits and credits they are entitled to.","publishedDate":"2022-02-21T13:00:00-05:00","title":"Saskatchewan, tax-filing season starts today!"},{"link":"/en/revenue-agency/news/2022/02/yukon-nunavut-and-the-northwest-territories-tax-filing-season-starts-today.html","teaser":"The Canada Revenue Agency (CRA) is committed to making sure residents of Yukon, Nunavut, and the Northwest Territories get the benefits and credits they are entitled to.","publishedDate":"2022-02-21T14:00:00-05:00","title":"Yukon, Nunavut, and the Northwest Territories, tax-filing season starts today!"},{"link":"/en/revenue-agency/news/2022/02/alberta-tax-filing-season-starts-today.html","teaser":"The Canada Revenue Agency (CRA) is committed to making sure residents of Alberta get the benefits and credits they are entitled to.","publishedDate":"2022-02-21T15:00:00-05:00","title":"Alberta, tax-filing season starts today!"},{"link":"/en/revenue-agency/news/2022/02/british-columbia-tax-filing-season-starts-today.html","teaser":"The Canada Revenue Agency (CRA) is committed to making sure residents of British Columbia get the benefits and credits they are entitled to.","publishedDate":"2022-02-21T16:00:00-05:00","title":"British Columbia, tax-filing season starts today!"},{"link":"/en/revenue-agency/news/2022/03/canada-revenue-agency-teleworking-positions-available-outside-quebec-major-centers.html","teaser":"The Canada Revenue Agency (CRA) seeks to fill several bilingual customer service positions in its call centers for terms of up to 2 years. ","publishedDate":"2022-03-22T16:10:34-04:00","title":"Canada Revenue Agency: teleworking positions available outside Québec major centers"},{"link":"/en/revenue-agency/news/2022/04/new-members-appointed-to-the-advisory-committee-on-the-charitable-sector.html","teaser":"Charities play a key role in our society by providing valuable information and services to Canadians, with a particular focus on the most vulnerable. ","publishedDate":"2022-04-05T15:30:00-04:00","title":"New members appointed to the Advisory Committee on the Charitable Sector"},{"link":"/en/revenue-agency/news/2022/05/update-on-the-government-of-canada-issuing-debt-notification-to-ineligible-canada-emergency-response-benefit-recipients.html","teaser":"The quick and decisive actions taken by the Government of Canada to provide income support through the Canada Emergency Response Benefit (CERB) helped more than 8 million workers and their families stay afloat, and millions more through the Canada Recovery Benefit (CRB) that followed.","publishedDate":"2022-05-10T14:58:42-04:00","title":"Update on the Government of Canada issuing debt notification to ineligible Canada Emergency Response Benefit recipients"},{"link":"/en/revenue-agency/news/2022/06/minister-of-national-revenue-publishes-canadas-first-overall-tax-gap-report.html","teaser":"Today, the Honourable Diane Lebouthillier, Minister of National Revenue, is building on her commitment to study Canada’s tax gap by publishing Canada’s first overall tax gap report.","publishedDate":"2022-06-28T07:00:00-04:00","title":"Minister of National Revenue publishes Canada’s first overall tax gap report"},{"link":"/en/revenue-agency/news/2022/06/overall-federal-tax-gap-report-and-tax-gap-methodological-annex.html","teaser":"The Canada Revenue Agency (CRA) has published a series of reports on Canada's tax gap. ","publishedDate":"2022-06-28T07:00:00-04:00","title":"Overall Federal Tax Gap Report and Tax Gap Methodological Annex"},{"link":"/en/revenue-agency/news/2017/09/minister_lebouthillierannouncesthecanadarevenueagencysreturntoyu.html","teaser":"The Government of Canada is committed to making the Canada Revenue Agency (CRA) fairer and more useful and to making it easier for clients to access its services.","publishedDate":"2017-09-01T13:56:35-04:00","title":"Minister Lebouthillier announces the Canada Revenue Agency’s return to Yukon"},{"link":"/en/revenue-agency/news/2017/11/statement_by_thecanadarevenueagency-offshorefinancialstructures.html","teaser":"In the wake of renewed media attention concerning offshore financial structures, the Canada Revenue Agency (CRA) is delivering the following statement to inform Canadians on the work and progress being made to combat tax evasion and tax avoidance.","publishedDate":"2017-11-03T18:02:22-04:00","title":"Statement by the Canada Revenue Agency - Offshore financial structures"},{"link":"/en/revenue-agency/news/2017/09/minister_lebouthilliershareswithcanadiansthelatestresultsofcrack.html","teaser":"Canadians work hard to support their families and to pay their taxes. They also expect their Government to work hard on their behalf to ensure a tax system that is responsive, fair and where everyone pays their share. ","publishedDate":"2017-09-07T11:59:57-04:00","title":"Minister Lebouthillier shares with Canadians the latest results of cracking down on tax cheats"},{"link":"/en/revenue-agency/news/2018/02/minister_lebouthillierstrengthensinternationalpartnershipstofigh.html","teaser":"Strengthening tax fairness by working with international partners to crack down on tax evasion and aggressive tax avoidance is a key commitment for the Government of Canada and will help to ensure that the tax system is fair for all Canadians.","publishedDate":"2018-02-21T05:55:00-05:00","title":"Minister Lebouthillier strengthens international partnerships to fight offshore tax fraud, evasion and aggressive tax avoidance"},{"link":"/en/revenue-agency/news/2017/12/minister_lebouthillierannouncestighteningofthevoluntarydisclosur.html","teaser":"Canadians work hard and expect their Government to do the same to ensure a tax system that is equitable, where everyone pays their fair share. The Canada Revenue Agency’s (CRA) Voluntary Disclosures Program (VDP) is a way for taxpayers to correct errors in their tax affairs. However, this program has been used by certain wealthy individuals and corporations as a way to avoid the consequences of their aggressive tax planning.   ","publishedDate":"2017-12-15T06:00:00-05:00","title":"Minister Lebouthillier announces tightening of the Voluntary Disclosures Program to ensure greater tax fairness"},{"link":"/en/revenue-agency/news/2018/02/minister_of_nationalrevenuewelcomesfavourablytheoffshorecomplian.html","teaser":"The Honourable Diane Lebouthillier, Minister of National Revenue, today issued the following statement","publishedDate":"2018-02-19T13:13:16-05:00","title":"Minister of National Revenue welcomes favourably the Offshore Compliance Advisory Committee recommendations on the analysis of big data"},{"link":"/en/revenue-agency/news/2018/02/minister_lebouthilliertotraveltofrancetomeetwiththecrasinternati.html","teaser":"The Government of Canada is committed to ensuring that the tax system is fair to all Canadians. To that end, the Canada Revenue Agency (CRA) is working with its international partners to combat offshore tax evasion and aggressive tax avoidance by enhancing information sharing and refining its practices.","publishedDate":"2018-02-16T12:22:49-05:00","title":"Minister Lebouthillier to travel to France to meet with the CRA's international partners in efforts to combat tax evasion and aggressive tax avoidance"},{"link":"/en/revenue-agency/news/2018/02/the_canada_revenueagencyislaunchingthe2018taxfilingseason.html","teaser":"The Canada Revenue Agency (CRA) is continuously working to improve its services to make it easier for Canadians to file their tax returns and access the credits and benefits to which they are entitled. ","publishedDate":"2018-02-22T13:41:08-05:00","title":"The Canada Revenue Agency is launching the 2018 tax filing season"},{"link":"/en/revenue-agency/news/2018/05/government-of-canada-offers-taxpayer-relief-to-canadians-affected-by-flooding.html","teaser":"The Canada Revenue Agency (CRA) understands that natural disasters cause hardship for Canadians whose primary concerns in such times are for their families, homes and communities.","publishedDate":"2018-05-24T11:00:53-04:00","title":"Government of Canada offers taxpayer relief to Canadians affected by flooding"},{"link":"/en/revenue-agency/news/2022/08/approximately-14-billion-in-uncashed-cheques-is-sitting-in-the-canada-revenue-agencys-coffers.html","teaser":"The Canada Revenue Agency (CRA) has approximately $1.4 billion in cheques that have gone uncashed over the years.","publishedDate":"2022-08-05T14:44:05-04:00","title":"Approximately $1.4 billion in uncashed cheques is sitting in the Canada Revenue Agency’s coffers"},{"link":"/en/revenue-agency/news/2018/02/the_government_ofcanadaislaunchingatellusonceapproachforonlinedi.html","teaser":"The Government of Canada continues to work to provide Canadians with high-quality service that will help them manage their tax and benefits online, anytime and anywhere. It will now be easier for Canadians to update and share their direct deposit banking information quickly and safely between the Canada Revenue Agency (CRA), and Employment and Social Development Canada (ESDC). ","publishedDate":"2018-02-14T09:46:03-05:00","title":"The Government of Canada is launching a “tell us once” approach for online direct deposit payments"},{"link":"/en/revenue-agency/news/2022/08/new-members-appointed-to-the-advisory-committee-for-persons-with-disabilities.html","teaser":"Today, the Honourable Diane Lebouthillier, Minister of National Revenue, announced the appointment of six new members to the Disability Advisory Committee (DAC).","publishedDate":"2022-08-30T08:07:32-04:00","title":"New members appointed to the Advisory Committee for persons with disabilities"},{"link":"/en/revenue-agency/news/2022/10/minister-of-national-revenue-announces-more-support-for-organizations-that-help-improve-access-to-benefits-and-credits.html","teaser":"Whether it’s the Canada Child Benefit, the GST/HST credit, or the Climate Action Incentive, benefits and credits continue to be central to helping Canadians with the cost of living by making life more affordable.","publishedDate":"2022-10-13T15:02:57-04:00","title":"Minister of National Revenue announces more support for organizations that help improve access to benefits and credits"},{"link":"/en/revenue-agency/news/2022/10/new-members-appointed-to-the-advisory-committee-on-the-charitable-sector.html","teaser":"Today, the Honourable Diane Lebouthillier, Minister of National Revenue, announced the updated membership for the Advisory Committee on the Charitable Sector (ACCS). ","publishedDate":"2022-10-26T07:44:48-04:00","title":"New members appointed to the Advisory Committee on the Charitable Sector"},{"link":"/en/revenue-agency/news/2022/11/minister-of-national-revenue-announces-the-participation-of-nunavut-and-ontario-in-the-organ-and-tissue-donation-service-offering.html","teaser":"Since the unanimous adoption of Bill C-210, the Canada Revenue Agency (CRA) has been working with provinces and territories so that Canadians can indicate their desire to receive information about becoming an organ and tissue donor from their provincial or territorial government.  ","publishedDate":"2022-11-18T14:05:27-05:00","title":"Minister of National Revenue announces the participation of Nunavut and Ontario in the organ and tissue donation service offering"},{"link":"/en/revenue-agency/news/2022/11/applications-for-the-new-canada-dental-benefit-are-now-open.html","teaser":"Seeing a dental care professional is important not only for oral health, but for overall health. ","publishedDate":"2022-11-30T16:35:14-05:00","title":"Applications for the new Canada Dental Benefit are now open!"},{"link":"/en/revenue-agency/news/2022/12/canada-revenue-agencys-disability-advisory-committee-submits-10-recommendations-in-its-third-annual-report.html","teaser":"The Canada Revenue Agency’s (CRA) Disability Advisory Committee (DAC) released its 2022 annual report today.","publishedDate":"2022-12-02T13:19:14-05:00","title":"Canada Revenue Agency’s Disability Advisory Committee submits 10 recommendations in its third annual report"},{"link":"/en/revenue-agency/news/2022/12/the-government-of-canada-launches-formal-consultations-to-streamline-reporting-of-payroll-information.html","teaser":"The Government of Canada is committed to refining the way it delivers programs and services to Canadians and modernizing how businesses provide payroll information to the federal government, while protecting their personal information.","publishedDate":"2022-12-05T10:43:28-05:00","title":"The Government of Canada launches formal consultations to streamline reporting of payroll information "},{"link":"/en/revenue-agency/news/2022/12/statement-by-the-minister-of-national-revenue-the-honourable-diane-lebouthillier-and-minister-and-of-employment-workforce-development-and-disabilit.html","teaser":"Following the tabling of the 2022 Fall Reports of the Auditor General of Canada, the Minister of National Revenue, the Honourable Diane Lebouthillier and the Minister of Employment, Workforce Development and Disability Inclusion, the Honourable Carla Qualtrough issued the following statement in response to the report entitled \"Office of the Auditor General Performance Audit of COVID-19 Benefits\", which included recommendations for Employment and Social Development Canada (ESDC) and the Canada Revenue Agency (CRA).","publishedDate":"2022-12-06T12:13:19-05:00","title":"Statement by the Minister of National Revenue, the Honourable Diane Lebouthillier and Minister and of Employment, Workforce Development and Disability Inclusion, the Honourable Carla Qualtrough on the Auditor General of Canada (OAG)’s performance audit of Specific COVID-19 Benefits"},{"link":"/en/revenue-agency/news/2022/12/the-application-portal-for-the-one-time-top-up-to-the-canada-housing-benefit-is-now-open.html","teaser":"For many Canadians, rising inflation and the high cost of living have made it even more challenging to find a safe and affordable place to call home.","publishedDate":"2022-12-12T10:15:00-05:00","title":"Lower-income renters in Canada can now apply for a one-time $500 top-up to the Canada Housing Benefit"},{"link":"/en/revenue-agency/news/2023/01/update-on-collective-bargaining.html","teaser":"The Canada Revenue Agency (CRA) values the important role its employees play from across the country in delivering services to Canadians.","publishedDate":"2023-01-13T12:00:00-05:00","title":"Update on Collective Bargaining"},{"link":"/en/revenue-agency/news/2023/02/whats-new-and-what-to-remember-when-filing-your-taxes-in-manitoba-this-year.html","teaser":"Tax season is upon Manitoba residents and the Canada Revenue Agency (CRA) is getting ready to answer questions from taxpayers and make it easier and quicker for them to file their 2022 income tax and benefit return. ","publishedDate":"2023-02-12T14:29:58-05:00","title":"What's new and what to remember when filing your taxes in Manitoba this year"},{"link":"/en/revenue-agency/news/2023/02/whats-new-and-what-to-remember-when-filing-your-taxes-in-saskatchewan-this-year.html","teaser":"Tax season is upon Saskatchewan residents and the Canada Revenue Agency (CRA) is getting ready to answer questions from taxpayers and make it easier and quicker for them to file their 2022 income tax and benefit return. ","publishedDate":"2023-02-12T15:47:40-05:00","title":"What's new and what to remember when filing your taxes in Saskatchewan this year"},{"link":"/en/revenue-agency/news/2023/02/whats-new-and-what-to-remember-when-filing-your-taxes-in-alberta-this-year.html","teaser":"Tax season is upon Alberta residents and the Canada Revenue Agency (CRA) is getting ready to answer questions from taxpayers and make it easier and quicker for them to file their 2022 income tax and benefit return. ","publishedDate":"2023-02-12T12:45:34-05:00","title":"What's new and what to remember when filing your taxes in Alberta this year"},{"link":"/en/revenue-agency/news/2023/02/whats-new-and-what-to-remember-when-filing-your-taxes-in-british-columbia-this-year.html","teaser":"Tax season is upon British Columbia residents and the Canada Revenue Agency (CRA) is getting ready to answer questions from taxpayers and make it easier and quicker for them to file their 2022 income tax and benefit return. ","publishedDate":"2023-02-12T16:49:12-05:00","title":"What's new and what to remember when filing your taxes in British Columbia this year"},{"link":"/en/revenue-agency/news/2023/02/whats-new-and-what-to-remember-when-filing-your-taxes-in-yukon-nunavut-and-the-northwest-territories-this-year.html","teaser":"Tax season is upon the Yukon, Nunavut, and the Northwest Territories residents and the Canada Revenue Agency (CRA) is getting ready to answer questions from taxpayers and make it easier and quicker for them to file their 2022 income tax and benefit return. ","publishedDate":"2023-02-12T18:54:08-05:00","title":"What's new and what to remember when filing your taxes in Yukon, Nunavut, and the Northwest Territories this year"},{"link":"/en/revenue-agency/news/2023/02/whats-new-and-what-to-remember-when-filing-your-taxes-in-nova-scotia-this-year.html","teaser":"Tax season is upon Nova Scotia residents and the Canada Revenue Agency (CRA) is getting ready to answer questions from taxpayers and make it easier and quicker for them to file their 2022 income tax and benefit return. ","publishedDate":"2023-02-13T11:51:00-05:00","title":"What's new and what to remember when filing your taxes in Nova Scotia this year"},{"link":"/en/revenue-agency/news/2023/02/whats-new-and-what-to-remember-when-filing-your-taxes-in-prince-edward-island-this-year.html","teaser":"Tax season is upon Prince Edward Island residents and the Canada Revenue Agency (CRA) is getting ready to answer questions from taxpayers and make it easier and quicker for them to file their 2022 income tax and benefit return. ","publishedDate":"2023-02-13T12:09:30-05:00","title":"What's new and what to remember when filing your taxes in Prince Edward Island this year"},{"link":"/en/revenue-agency/news/2023/02/whats-new-and-what-to-remember-when-filing-your-taxes-in-new-brunswick-this-year.html","teaser":"Tax season is upon New Brunswick residents and the Canada Revenue Agency (CRA) is getting ready to answer questions from taxpayers and make it easier and quicker for them to file their 2022 income tax and benefit return.","publishedDate":"2023-02-13T12:28:14-05:00","title":"What's new and what to remember when filing your taxes in New Brunswick this year"},{"link":"/en/revenue-agency/news/2023/02/whats-new-and-what-to-consider-when-filing-your-taxes-in-quebec-this-year.html","teaser":"Tax season is upon Quebec residents and the Canada Revenue Agency (CRA) is getting ready to answer questions from taxpayers and make it easier and quicker for them to file their 2022 income tax and benefit return.","publishedDate":"2023-02-21T14:29:00-05:00","title":"What's new and what to remember before filing your taxes in Quebec this year"},{"link":"/en/revenue-agency/news/2023/02/whats-new-and-what-to-remember-when-filing-your-taxes-in-newfoundland-and-labrador-this-year.html","teaser":"Tax season is upon Newfoundland and Labrador residents and the Canada Revenue Agency (CRA) is getting ready to answer questions from taxpayers and make it easier and quicker for them to file their 2022 income tax and benefit return. ","publishedDate":"2023-02-13T11:48:21-05:00","title":"What's new and what to remember when filing your taxes in Newfoundland and Labrador this year"},{"link":"/en/revenue-agency/news/2023/02/whats-new-and-what-to-remember-when-filing-your-taxes-in-ontario-this-year.html","teaser":"Tax season is upon Ontario residents and the Canada Revenue Agency (CRA) is getting ready to answer questions from taxpayers and make it easier and quicker for them to file their 2022 income tax and benefit return.","publishedDate":"2023-02-14T10:07:10-05:00","title":"What's new and what to remember when filing your taxes in Ontario this year"},{"link":"/en/revenue-agency/news/2023/02/the-canada-revenue-agency-kicks-off-the-2023-tax-filing-season-canadians-need-to-file-their-returns-before-may-1.html","teaser":"Tax season has officially kicked off and  many Canadians will turn to the Canada Revenue Agency (CRA) for guidance","publishedDate":"2023-02-20T10:30:00-05:00","title":"The Canada Revenue Agency kicks off the 2023 tax-filing season: Canadians need to file their returns before May 1"},{"link":"/en/revenue-agency/news/2023/03/cra-commissioner-bob-hamiltons-response-to-the-national-security-and-intelligence-review-agency-nsira.html","teaser":"Thank you for your letter of March 8, 2023, advising of the National Security and Intelligence Review Agency (NSIRA)’s intent to initiate a review of national security activities conducted by the Review and Analysis Division (RAD) of the Canada Revenue Agency (CRA).","publishedDate":"2023-03-14T10:22:27-04:00","title":"CRA Commissioner Bob Hamilton’s response to the National Security and Intelligence Review Agency"},{"link":"/en/revenue-agency/news/2023/03/statement-by-the-honourable-diane-lebouthillier-minister-of-national-revenue-in-response-to-the-national-security-and-intelligence-review-agency-re.html","teaser":"The Honourable Diane Lebouthillier, Minister of National Revenue, today issued the following statement in response to the National Security and Intelligence Review Agency review of the Canada Revenue Agency’s Review and Analysis Division.","publishedDate":"2023-03-14T09:39:40-04:00","title":"Statement by the Honourable Diane Lebouthillier, Minister of National Revenue, in response to the National Security and Intelligence Review Agency review of the Canada Revenue Agency’s Review and Analysis Division"},{"link":"/en/revenue-agency/news/2023/03/statement-by-the-honourable-diane-lebouthillier-minister-of-national-revenue-in-response-to-the-office-of-the-taxpayers-ombudsperson-report-on-fair.html","teaser":"The Honourable Diane Lebouthillier, Minister of National Revenue, today issued the following statement in response to the Office of the Taxpayers’ Ombudsperson Report on Fairness of the Audit Process for Charities in Canada.","publishedDate":"2023-03-27T15:35:00-04:00","title":"Statement by the Honourable Diane Lebouthillier, Minister of National Revenue, in response to the Office of the Taxpayers’ Ombudsperson Report on Fairness of the Audit Process for Charities in Canada"},{"link":"/en/revenue-agency/news/2023/03/the-canada-revenue-agency-to-begin-mediation-with-public-service-alliance-of-canada--union-of-taxation-employees-in-mid-april.html","teaser":"The Canada Revenue Agency (CRA) values the important role its employees play from across the country in delivering services to Canadians. ","publishedDate":"2023-03-31T15:40:00-04:00","title":"The Canada Revenue Agency to Begin Mediation with Public Service Alliance of Canada – Union of Taxation Employees in mid-April"},{"link":"/en/revenue-agency/news/2023/04/canada-revenue-agency-responds-to-public-service-alliance-of-canadaunion-of-taxation-employees-strike-vote.html","teaser":"The Canada Revenue Agency (CRA) values the important role its employees play from across the country in delivering services to Canadians. ","publishedDate":"2023-04-07T14:14:00-04:00","title":"Canada Revenue Agency responds to Public Service Alliance of Canada–Union of Taxation  Employees strike vote"},{"link":"/en/revenue-agency/news/2023/04/canada-revenue-agency-remains-committed-to-reaching-a-fair-agreement.html","teaser":"Today, the Canada Revenue Agency (CRA) and the Public Service Alliance of Canada – Union of Taxation Employees (PSAC-UTE) entered mediated negotiations with the goal of reaching a fair collective agreement. ","publishedDate":"2023-04-17T21:23:00-04:00","title":"Canada Revenue Agency remains committed to reaching a fair agreement "},{"link":"/en/revenue-agency/news/2023/04/the-canada-revenue-agency-responds-to-the-public-service-alliance-of-canadaunion-of-taxation-employees-strike-action.html","teaser":"Over the last few months, the Canada Revenue Agency (CRA) has made every reasonable effort to avoid a labour disruption affecting important services that Canadians rely on, especially during tax season. ","publishedDate":"2023-04-19T10:20:00-04:00","title":"The Canada Revenue Agency responds to the Public Service Alliance of Canada–Union of Taxation Employees’ strike action"},{"link":"/en/revenue-agency/news/2023/04/canada-revenue-agencys-update-on-negotiations-with-the-public-service-alliance-of-canada--union-of-taxation-employees.html","teaser":"The Canada Revenue Agency (CRA) respects the collective bargaining process and remains committed to continuing to bargain in good faith with the Public Service Alliance of Canada – Union of Taxation Employees (PSAC-UTE) with a view to conclude a new collective agreement that is both fair to employees and reasonable for Canadian taxpayers as soon as possible.","publishedDate":"2023-04-21T20:41:00-04:00","title":"Canada Revenue Agency’s update on negotiations with the Public Service Alliance of Canada – Union of Taxation Employees"},{"link":"/en/revenue-agency/news/2023/04/psac-utes-bargaining-demands-and-the-cras-path-to-a-settlement.html","teaser":"In January 2022, the Canada Revenue Agency (CRA) and the Public Service Alliance of Canada – Union of Taxation Employees (PSAC-UTE) began negotiations on renewed collective agreements for the Program Delivery and Administrative Group (PDAS), which comprise approximately 39,000 employees.","publishedDate":"2023-04-24T09:22:00-04:00","title":"PSAC-UTE’s bargaining demands and the CRA’s path to a settlement"},{"link":"/en/revenue-agency/news/2023/05/canada-revenue-agency-and-public-service-alliance-of-canada--union-of-taxation-employees-to-resume-in-person-negotiations.html","teaser":"Today, The Canada Revenue Agency (CRA) and the Public Service Alliance of Canada – Union of Taxation Employees (PSAC-UTE) have resumed in person negotiations with a view to reach a new collective agreement as soon as possible, that is both fair to employees and reasonable for taxpayers.","publishedDate":"2023-05-01T14:45:00-04:00","title":"Canada Revenue Agency and Public Service Alliance of Canada – Union of Taxation Employees to resume in-person negotiations"},{"link":"/en/revenue-agency/news/2023/05/the-canada-revenue-agency-reaches-a-tentative-agreement-with-the-public-service-alliance-of-canada--union-of-taxation-employees.html","teaser":"Last night, the Canada Revenue Agency (CRA) reached a 4-year tentative agreement with the Public Service Alliance of Canada – Union of Taxation Employees (PSAC-UTE). Upon ratification, this agreement will apply to approximately 39,000 PSAC-UTE employees working at the CRA. PSAC-UTE employees will return to work this morning.","publishedDate":"2023-05-04T01:50:34-04:00","title":"The Canada Revenue Agency reaches a tentative agreement with the Public Service Alliance of Canada – Union of Taxation Employees"},{"link":"/en/revenue-agency/news/2023/05/the-canada-pension-plan-enhancement--businesses-individuals-and-self-employed-what-it-means-for-you.html","teaser":"The Canada Pension Plan (CPP) enhancement, which was introduced on January 1, 2019, is designed to help increase retirement income for working Canadians and their families.The CPP is a mandatory pension plan financed by contributions from employees, employers and self-employed individuals. It covers virtually all workers in Canada except Quebec, which administers its own plan called the Quebec Pension Plan (QPP). The CPP replaces a basic level of earnings for contributors upon retirement, disability, or death.","publishedDate":"2023-05-04T12:53:12-04:00","title":"The Canada Pension Plan enhancement – Businesses, individuals, and self-employed: what it means for you"},{"link":"/en/revenue-agency/news/2023/05/increased-funding-for-organizations-that-host-free-tax-clinics.html","teaser":"The Canada Revenue Agency (CRA) is updating the Community Volunteer Income Tax Program (CVITP) Grant funding formula to expand the impact of free tax clinics and help eligible volunteer organizations serve Canadians seeking support to file their annual income tax and benefit return.","publishedDate":"2023-05-24T15:27:27-04:00","title":"Increased funding for organizations that host free tax clinics"},{"link":"/en/revenue-agency/news/2023/05/minister-lebouthillier-announces-increased-funding-for-organizations-that-help-vulnerable-people-access-benefits-and-credits.html","teaser":"Whether it’s the Canada Child Benefit, the Canada Workers Benefit, the GST/HST Credit, the Climate Action Incentive or the new grocery rebate, benefits and credits continue to play a crucial role in helping Canadians with the cost of living.","publishedDate":"2023-05-24T15:15:41-04:00","title":"Minister Lebouthillier announces increased funding for organizations that help vulnerable people access benefits and credits"},{"link":"/en/revenue-agency/news/2023/05/parliamentarysecretary-fragiskatos-announces-increased-funding-for-organizations-that-help-vulnerable-people-access-benefits-and-credits.html","teaser":"Whether it’s the Canada Child Benefit, the Canada Workers Benefit, the GST/HST Credit, the Climate Action Incentive or the new grocery rebate, benefits and credits continue to play a crucial role in helping Canadians with the cost of living.","publishedDate":"2023-05-25T06:00:00-04:00","title":"Parliamentary Secretary Fragiskatos announces increased funding for organizations that help vulnerable people access benefits and credits"},{"link":"/en/revenue-agency/news/2023/06/government-of-canada-approves-the-collective-agreement-between-the-cra-and-the-psac-ute.html","teaser":"The Government of Canada has approved the renewed collective agreement between the Canada Revenue Agency (CRA) and the Public Service Alliance of Canada – Union of Taxation Employees (PSAC-UTE) for approximately 39,000 employees.","publishedDate":"2023-06-23T10:23:00-04:00","title":"Government of Canada approves the collective agreement between the CRA and the PSAC-UTE"},{"link":"/en/revenue-agency/news/2023/06/the-canada-revenue-agency-and-the-workplace-safety-and-insurance-board-partner-to-give-ontario-businesses-another-way-to-pay-their-wsib-premiums.html","teaser":"Starting today, the Canada Revenue Agency (CRA) and the Workplace Safety and Insurance Board (WSIB) are giving Ontario businesses a new option to pay their WSIB premiums. ","publishedDate":"2023-07-04T06:00:00-04:00","title":"The Canada Revenue Agency and the Workplace Safety and Insurance Board partner to give Ontario businesses another way to pay their WSIB premiums"},{"link":"/en/revenue-agency/news/2023/09/the-canada-revenue-agency-reaches-a-tentative-agreement-with-the-professional-institute-of-the-public-service-of-canada-for-the-audit-financial-and.html","teaser":"On September 16, 2023, the Canada Revenue Agency (CRA) and the Professional Institute of the Public Service of Canada for the Audit, Financial and Scientific Group (PIPSC-AFS Group) reached a tentative agreement for approximately 16,000 CRA employees.","publishedDate":"2023-09-19T15:38:00-04:00","title":"The Canada Revenue Agency reaches a tentative agreement with the Professional Institute of the Public Service of Canada for the Audit, Financial and Scientific Group"},{"link":"/en/revenue-agency/news/2023/10/the-government-of-canada-has-announced-a-call-for-applications-for-the-independent-advisory-board-on-eligibility-for-journalism-tax-measures.html","teaser":"The Government of Canada has announced a call for applications for new members for the Independent Advisory Board on Eligibility for Journalism Tax Measures (Advisory Board).","publishedDate":"2023-10-26T07:19:23-04:00","title":"The Government of Canada has announced a call for applications for the Independent Advisory Board on Eligibility for Journalism Tax Measures"},{"link":"/en/revenue-agency/news/2023/10/residents-of-the-yukon-can-now-apply-for-the-canada-child-benefit-when-registering-for-the-birth-of-their-newborn.html","teaser":"The Government of Canada continuously strives to improve services to help Canadians receive the benefits they are entitled to.","publishedDate":"2023-10-30T16:30:00-04:00","title":"Residents of the Yukon can now apply for the Canada child benefit when registering for the birth of their newborn"},{"link":"/en/revenue-agency/news/2023/10/underused-housing-tax-transitional-relief-period-extended-until-april-30-2024.html","teaser":"The Minister of National Revenue announces that owners affected by the Underused Housing Tax (UHT) will have until April 30, 2024, to file their returns for the 2022 calendar year without being charged penalties or interest.","publishedDate":"2023-10-31T14:30:00-04:00","title":"Government of Canada extends deadline for homeowners to file their Underused Housing Tax return"},{"link":"/en/revenue-agency/news/2023/11/j5-countries-host-cyber-challenge-focused-on-data-mining-and-financial-reporting.html","teaser":"The Joint Chiefs of Global Tax Enforcement (J5) brought together investigators, cryptocurrency experts and data scientists this week in a coordinated push to track down individuals and organizations perpetrating tax crimes around the world.","publishedDate":"2023-11-02T11:30:00-04:00","title":"J5 countries host “Cyber Challenge” focused on data mining and financial reporting"},{"link":"/en/revenue-agency/news/2023/11/federal-job-fair-in-jonquiere-on-november-18.html","teaser":"The Canada Revenue Agency, in collaboration with other federal employers, is organizing a job fair at the Jonquière Tax Center.","publishedDate":"2023-11-16T12:26:13-05:00","title":"Federal job fair in Jonquière on November 18"},{"link":"/en/revenue-agency/news/2023/11/the-canada-revenue-agency-continues-to-invest-in-free-tax-clinics.html","teaser":"Free tax clinics made it possible for more than 649,000 Canadians with a modest income to file their taxes and receive more than $1.75 billion in benefits, credits, and refunds last year, announced the Honourable Marie-Claude Bibeau, Minister of National Revenue.","publishedDate":"2023-11-16T10:58:08-05:00","title":"The Canada Revenue Agency continues to invest in free tax clinics"}]}}